/*
Рефлексия по заданию 3.
Понравилось, что в этом задании начали работать с связями между классами, понимаю, что сам легко мог бы сделать плохо, не подумав,
работал мало с системами, в которых действительно много классов. Еще в этом задании немного клинило при написании реализации, начинал
пару раз писать напрямую с указателями работу, вместо того, чтобы сразу использовать методы в LinkedList хранилище. А потом
наоборот сначала написал неэффективный removeAll, не учтя, что find в linkedlist каждый раз будет искать с начала и сложность станет
O(N^2) вместо O(N), хорошо, что на следующий день такие ошибки становятся заметнее. 
*/
