/*
Рефлексия по заданию 6.
Здесь особо не задумался над написанием кода, просто следовал схеме со списками, единственное, что добавил алиасы, так 
как сочетание enqueue/AddFront выглядело бы негармонично. По сравнению с курсом по АТД здесь снова разнесли операции в 
соответствии с CQS, и теперь не нужно ловить ошибки пользователям через try/catch, просто смотреть статусы операций.
Рефлексия постфактум.
Единственное отличие, что я сохранил enqueue/dequeue, и добавил алиасы, в остальном решения идентичны.
*/